# Java(2주차)

1. Java - 정의
    1. Java의 특징에 대해 설명해주세요
    2. JVM의 역할에 대해 설명해주세요
2. Java - 오버라이딩/오버로딩
    1. Overriding과 Overloading에 대해 설명해주세요
3. 공통 - 객체 지향
    1. 객체지향 프로그래밍이란 무엇인지 설명해주세요
    2. 객체지향 설계원칙에 대해 설명해주세요
4. Java - 인터페이스/ 추상 클래스
    1. 인터페이스와 추상 클래스의 정의에 대해 설명해주세요
    2. 둘의 차이점에 대해 설명해주세요.
5. Java - 클래스/객체/인스턴스
    1. 클래스와 객체, 인스턴스에 대해 설명해주세요

---

1. Java의 특징
java하면 객체지향언어라고 볼 수 있다.
자동메모리 관리가 된다. >> 자바의 메모리관리
C나 C++ 같은 경우는 OS레벨의 메모리에 직접 접근하기 때문에 동적으로 메모리를 할당받을 경우 free() 라는 메소드를 통해서 해제해주는 작업이 필요하다. 반면에 자바는 JVM이라는 가상머신을 이용해서 간접적으로 메모리에 접근해 메모리를 관리한다. 또한 가비지 컬렉션을 사용하여 메모리를 관리할 수도 있다.
안전하고 강력하다.
캡슐화를 지원한다. >> 접근제어자!!
자바는 캡슐화를 통해서 정보를 ‘은닉’한다. 클래스 안에서 변수와 함수를 관리하는 것이다. 정보에 해당하는 변수와 함수의 접근을 제어하기 위해서 접근 제어자를 사용한다. 많이 사용하는 public, private, protected 를 사용한다. 또한 setter 와 getter 함수를 사용하여 변수에 직접 접근하는 것을 막는다.
2. JVM의 역할
자바를 실행하기 위한 가상머신이다. 메모리를 관리하는데 용이하고 OS위에서 직접 접근하는 것이 아니기 때문에 관리가 편하다. java의 확장자 명인 .java는 CPU가 인식을 하지 못해 기계어로 컴파일 해주어야 한다. 하지만 Java는 JVM을 거쳐 OS에 도달하기에 JVM이 인식할 수 있는 .class로 변환된다. Java compiler가 .java 파일을 .class라는 바이트 코드로 변환하는데 이는 기계어가 아니다. 여기서 java compiler는 JDK를 설치하면 bin에 존재하는 javac.exe를 말한다.

![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/59cd4c89-62ac-48e7-b8b2-18c737f312e3/Untitled.png)

1. 오버라이딩
상속관계에서 부모에 이미 정의된 메소드를 자식 클래스에서 커스텀해서 사용할 수 있는 
2. 오버로딩
오버라이딩과 이름이 비슷하지만 전혀 다른 개념이다.
오버로딩은 한 클래스 내에 같은 이름을 가진 메소드라도 파라미터의 개수 또는 타입이 다르면 정의할 수 있는 기능이다.
3. 객체지향프로그래밍이란
객체지향 프로그래밍은 너어어무 방대하고 범위가 넓다. 본인이 생각한 객체지향 프로그래밍은 한마디로 정의하자면 ‘재사용’을 통한 유지보수이다. 객체지향적 코드를 작성하기 위해 항상 고민하는 것은 좋은 개발자가 되기 위해 반드시 필요하다고 생각한다. 서비스(기능) 별로 리팩토링하고 재사용 할 수 있도록 만들면 코드를 수정하고 새로운 기능을 추가하는데 용이하다. 예를 들어 Spring Boot 의 Configuration 부분이나 Bean 등록을 직접 해주는 경우 서비스를 다시 갈아끼울 때 있어서 굉장히 편한데 이것이 객체 지향 프로그래밍이다. 게다가 인터페이스를 만들고 이에 해당하는 메소드들을 따로 분리해주면 추가 삭제 변경이 매우 용이해지기 때문에 객체지향적 사고를 하는 것은 굉장히 중요하다.
4. 객체지향 설계원칙
SOLID
SRP(단일 책임 원칙) : 오직 하나의 대상에 대해서만 책임
OCP(개방-폐쇄 원칙) : 요구사항이 변경될 때 새로운 동작이 추가될 수는 있으나 기존의 코드를 수정하지는 않도록 한다
LSP(리스코프 치환 원칙) : 하위 타입은 상위 타입을 대체해야한다. 상위 타입이 하위 타입으로 변경되어도 차이점을 인식하지 못해야한다.
DIP(의존 역전 원칙) : 
ISP(인터페이스 분리 원칙) : 목적과 기능에 따라 인터페이스를 분리해야한다. 
5. 인터페이스와 추상클래스
먼저 인터페이스를 작성하면 사용할 메소드를 미리 정의할 수 있고 이 인터페이스를 상속 받으면서 간편하게 커스텀하여 사용할 수 있다. 인터페이스 끼리도 상속 받을 수 있는 점이 있다.
추상클래스는 모듈처럼 중복되는 부분이나 공통적인 부분은 미리 다 만들어진 것을 사용하고, 이를 받아 사용하는 쪽에서는 자신에게 필요한 부분만을 재정의하여 사용함으로써 생산성이 향상되고 배포 등이 쉬워지기 때문입니다. 이러한 추상 메소드는 선언부만이 존재하며, 구현부는 작성되어 있지 않습니다. 바로 이 작성되어 있지 않은 구현부를 자식 클래스에서 오버라이딩하여 사용하는 것입니다.
6. 둘의 차이점
추상클래스는 상속받아서 기능을 이용하고(오버라이딩 필요) 인터페이스는 함수의 껍데기 즉 함수의 구현을 강제하는 것이다.
또한 상속이라는 개념과 다향성이라는 개념을 알고 있는지를 가를 수 있는 질문이다.
7. 클래스, 객체, 인스턴